import React from "react";

const knowledge = ({ selected }) => {
  let title, body;
  if (selected.name === "น้ำท่วมถนน") {
    title = "ทุกพื้นที่ มีแต่น้ำ (รอการระบาย)";
    body =
      "นับตั้งแต่ปี 2555-2566 กทม.ใช้งบในการจัดการปัญหาน้ำท่วมไปมากกว่า 52,000 ล้านบาท แต่เมื่อฝนตกหนัก หลายที่ก็ยังคงมีน้ำท่วมถนนอยู่ และพื้นศูนย์กลางธุรกิจและพาณิชยกรรมเป็นพื้นที่ที่พบเจอกับปัญหาน้ำท่วมขังบนถนนมากที่สุด เมื่อเทียบกับพื้นที่อื่นๆ ของ กทม.";
  } else if (selected.name === "พื้นที่สีเขียว") {
    title = "ก็ยังไม่เพียงพอสักที..";
    body =
      "ข้อมูลเดือนพฤษภาคม 2567 ระบุว่า กทม.มีพื้นที่สีเขียวให้กับประชาชน 1 คน คนละ 7.87 ตร.ม. และเมื่อคำนวณเฉพาะพื้นที่สีเขียวที่เข้าถึงได้จริง (พื้นที่สวนสาธารณะหลัก) ชาว กทม. 1 คนได้พื้นที่สีเขียวไว้ใช้บริการเพียง 1.20 ตร.ม. เท่านั้น";
  } else if (selected.name === "มลพิษในคลอง") {
    title = "เมื่อพื้นที่ค้าขาย กลับมีมลพิษในน้ำคลองมากกว่าพื้นที่อื่น..";
    body =
      "พื้นที่ธุรกิจและพาณิชยกรรมเป็นพื้นที่ที่มีน้ำคลองเน่าเสียมากที่สุด โดยเฉพาะน้ำคลองในบริเวณเขตคลองเตย เขตปทุมวัน เขตบางรัก และเขตดินแดง ทั้ง 4 เขตนี้ล้วนเป็นพื้นที่ที่มีมลพิษในน้ำคลองเกินค่ามาตรฐานมาโดยตลอด 12 ปี";
  } else if (selected.name === "ขยะมูลฝอย") {
    body =
      "รู้หรือไม่? กทม. ใช้งบประมาณในการรักษาความสะอาดและจัดการขยะมูลฝอยในแต่ละปีไม่ต่ำกว่า 1,000 ล้านบาท แต่มีรายได้มาชดเชยภาระตรงนี้เพียงปีละประมาณ 500 ล้านบาทซึ่งคิดเป็นแค่ 50% เท่านั้น และนับวัน ปริมาณขยะก็ยังคงเพิ่มขึ้นอย่างต่อเนื่อง ในขณะที่ปลายทางขยะส่วนใหญ่คือการฝังกลบนอกพื้นที่ กทม. ซึ่งสร้างผลกระทบสิ่งแวดล้อมอย่างมาก";
  } else if (selected.name === "ฝุ่นควันเกินมาตรฐาน") {
    title = "PM2.5 ความท้าทายหน้าใหม่ของคนกรุง";
    body =
      "รู้หรือไม่ว่า ช่วงเดือนพฤศจิกายนถึงกุมภาพันธ์ของอีกปี เป็นช่วงที่ค่าฝุ่นจะเกินค่ามาตรฐานบ่อยที่สุด";
  }

  return (
    <span
      className="py-4 rounded-b"
      style={{ backgroundColor: selected.color50 }}
    >
      {title ? <p className="mb-3 font-bold leading-tight h3">{title}</p> : ""}
      <p className="px-5 leading-tight p2">{body}</p>
    </span>
  );
};

export default knowledge;
